{
  "data": [
    {
      "year": 2021,
      "title": "Principal Architect",
      "subtitle": "Auna, Lima",
      "details": [
        "Liderar el equipo de Arquitectura Digital y DevSecOps.",
        "Liderar las decisiones de toda la empresa hacia la visión y la estrategia de la tecnología.",
        "Preparar el roadmap, documentación y presentaciones de arquitectura para toda la organización.",
        "Liderar el Centro de Excelencia (CoE) de arquitectura.",
        "Proveer gobierno, orientación y capacitaciones de diferentes arquitectos y equipos de negocios sobre Well Architect, Arquitectura MACH, etc.",
        "Proponer nuevas soluciones digitales que puedan ayudar en la transformación e innovación de AUNA.",
        "Asegurar de que se mantengan los principios de la arquitectura y el QOA (Quality of Architecture).",
        "Apoyar el desarrollo del equipo de Arquitectos mediante coaching, mentoring, capacitaciones y brindar oportunidades para mantener el mayor talento."
      ]
    },
    {
      "year": 2020,
      "title": "Arquitecto de Soluciones",
      "subtitle": "Auna, Lima",
      "details": [
        "Lanzamiento de la primera aplicación de transformación digital usando nuevas tecnologías orientadas a Serverless.",
        "Implementación de Validación de identidad usando biometría para el control, accesos y firma digital de una persona en las soluciones digitales.",
        "Implementación de Identity Broker para el manejo de autentificación y autorización.",
        "Implementación de Payment Broker para todas las soluciones digitales"
      ]
    },
    {
      "year": 2016,
      "title": "Arquitecto de Soluciones",
      "subtitle": "Belcorp, Lima",
      "details": [
        "Implementación de la primera plataforma DevOps para aplicaciones móviles",
        "Documentación de estándares de las principales tecnologías .Net, Java, Kotlin, JavaScript, etc.",
        "Uso de una arquitectura limpia para el desarrollo de aplicaciones móviles",
        "Implementación de la arquitectura de microservicios, visión y la plataforma de APIs"
      ]
    },
    {
      "year": 2016,
      "title": "Associate Consultant",
      "subtitle": "Hundred, Lima",
      "details": [
        "Reducción del 50% del tiempo en el proceso de sincronización de la aplicación \"Gestiona tu Negocio\".",
        "Implementación de un modelo de actualización opcional y / u obligatorio para aplicaciones móviles",
        "Primera implementación del patrón modular en las aplicaciones de Belcorp"
      ]
    },
    {
      "year": 2014,
      "title": "Technical Leader Mobile",
      "subtitle": "Avances Tecnológicos",
      "details": [
        "Implementación de Arquitectura para aplicaciones Yanbal para Consultores (Pedidos, Quiosco)",
        "Lanzamiento de la primera aplicación híbrida para Yanbal usando Ionic y Angular",
        "Ganador del concurso Fincyt por la idea de Cuponeo para MYPE",
        "Definición y desarrollo de la primera arquitectura de microservicios utilizando NodeJS para la empresa"
      ]
    }
  ]
}
