{
  "data": [
    {
      "year": 2021,
      "title": "Auna Architect",
      "subtitle": "Belcorp, Lima",
      "details": [
        "Leading the Digital Architecture and DevSecOps team.",
        "Lead company-wide decisions toward technology vision and strategy.",
        "Prepare the roadmap, documentation and architectural presentations for the entire organization.",
        "Leading the Center of Excellence (CoE) for Architecture.",
        "Provide governance, guidance and training of different architects and business teams on Well Architect, MACH Architecture, etc.",
        "Propose new digital solutions that can help in the transformation and innovation of AUNA.",
        "Ensure that the principles of architecture and QOA (Quality of Architecture) are maintained.",
        "Support the development of the Architect team through coaching, mentoring, training and providing opportunities to keep the greatest talent."
      ]
    },
    {
      "year": 2020,
      "title": "Solutions Architect",
      "subtitle": "Auna, Lima",
      "details": [
        "Launch of the first digital transformation application using new technologies oriented to Serverless.",
        "Implementation of identity validation using biometrics for the control, access and digital signature of a person in digital solutions.",
        "Identity Broker implementation for authentication and authorization management.",
        "Implementation of Payment Broker for all digital solutions"
      ]
    },
    {
      "year": 2016,
      "title": "Solutions Architect",
      "subtitle": "Belcorp, Lima",
      "details": [
        "Implementation of the first DevOps platform for mobile applications.",
        "Standards documentation of the main technologies .Net, Java, Kotlin, JavaScript, etc.",
        "Using clean architecture for mobile application development.",
        "Implementation of microservices architecture, vision and apis platform."
      ]
    },
    {
      "year": 2016,
      "title": "Associate Consultant",
      "subtitle": "Hundred, Lima",
      "details": [
        "50% reduction in time in the synchronization process for the App \"Gestiona tu Negocio\".",
        "Implementation of an optional and/or mandatory update model for mobile applications.",
        "First implementation of the modular pattern in Belcorp apps."
      ]
    },
    {
      "year": 2014,
      "title": "Technical Leader Mobile",
      "subtitle": "Avances Tecnológicos",
      "details": [
        "Implementation of Architecture for Yanbal applications for Consultants (Orders, Kiosk).",
        "Launch of the first hybrid app for Yanbal using Ionic and Angular.",
        "Winner of the Fincyt contest for the idea of Cuponeo for MYPEs.",
        "Definition and development of the first microservices architecture using NodeJS for the company."
      ]
    }
  ]
}
